Repository: extratone/i
Catalog: source/libiconv-41/libiconv-41/libiconv/po/*.po
Languages: vi

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
vi: Cách sử dụng: iconv [-c] [-s] [-f từ_mã] [-t đến_mã] [tập_tin ...]

source: or: iconv -l
vi: hay: iconv -l

source: Try `%s --help' for more information.
vi: Hãy thử lệnh trợ giúp « %s --help » để xem thông tin thêm.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
vi: Cách sử dụng: %s [TÙY_CHỌN...] [-f BẢNG_MÃ] [-t BẢNG_MÃ] [TẬP_TIN_NHẬP...]

source: or: %s -l
vi: hay: %s -l

source: Converts text from one encoding to another encoding.
vi: Chuyển đổi đoạn chữ từ bảng mã này sang bảng mã khác.

source: Options controlling the input and output format:
vi: Các tùy chọn điều khiển dạng thức nhập và xuất:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
vi: -f BẢNG_MÃ, --from-code=BẢNG_MÃ bảng mã của dữ liệu nhập

source: -t ENCODING, --to-code=ENCODING the encoding of the output
vi: -t BẢNG_MÃ, --to-code=BẢNG_MÃ bảng mã của dữ liệu xuất

source: Options controlling conversion problems:
vi: Các tùy chọn điều khiển vấn đề chuyển đổi:

source: -c discard unconvertible characters
vi: -c hủy các ký tự không thể chuyển đổi

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
vi: --unicode-subst=CHUỖI_DẠNG_THỨC sự thay thế các ký tự Unicode không thể chuyển đổi

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
vi: --byte-subst=CHUỖI_DẠNG_THỨC sư thay thế các byte không thể chuyển đổi

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
vi: --widechar-subst=CHUỖI_DẠNG_THỨC sự thay thế các ký tự rộng không thể chuyển đổi

source: Options controlling error output:
vi: Các tùy chọn điều khiển cách xuất lỗi:

source: -s, --silent suppress error messages about conversion problems
vi: -s, --silent thu hồi các thông điệp về vấn đề chuyển đổi

source: Informative output:
vi: Xuất thông tin:

source: -l, --list list the supported encodings
vi: -l, --list _liệt kê_ các bảng mã được hỗ trợ

source: --help display this help and exit
vi: --help hiển thị _trợ giúp_ này rồi thoát

source: --version output version information and exit
vi: --version hiển thị thông tin về _phiên bản_ rồi thoát

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
vi: Thông báo lỗi cho <bug-gnu-libiconv@gnu.org>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
vi: Phần mềm này là tự do; hãy xem mã nguồn để tìm điều kiện sao chép. KHÔNG bảo đảm gì cả, dù khả năng bán hay khả năng làm việc dứt khoát.

source: Written by %s.
vi: Tác giả: %s.

source: %s argument: A format directive with a variable width is not allowed here.
vi: Đối số %s: ở đây không cho phép chỉ thị dạng thức với độ rộng thay đổi.

source: %s argument: A format directive with a variable precision is not allowed here.
vi: Đối số %s: ở đây không cho phép chỉ thị dạng thức với độ chính xác thay đổi.

source: %s argument: A format directive with a size is not allowed here.
vi: Đối số %s: ở đây không cho phép chỉ thị dạng thức với kích cỡ.

source: %s argument: The string ends in the middle of a directive.
vi: Đối số %s: chuỗi kết thúc ở trong chỉ thị.

source: %s argument: The character '%c' is not a valid conversion specifier.
vi: Đối số %s: ký tự « %c » không phải là bộ xác định chuyển đổi hợp lệ.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
vi: Đối số %s: ký tự kết thúc chỉ thị dạng thức không phải là bộ xác định chuyển đổi hợp lệ.

source: cannot convert byte substitution to Unicode: %s
vi: không thể chuyển đổi sự thay thế byte sang Unicode: %s

source: cannot convert unicode substitution to target encoding: %s
vi: không thể chuyển đổi sự thay thế Unicode sang bảng mã đích: %s

source: cannot convert byte substitution to wide string: %s
vi: không thể chuyển đổi sự thay thế byte sang chuỗi rộng: %s

source: %s:%u:%u: incomplete character or shift sequence
vi: %s:%u:%u: dây kiểu ký tự hay dịch chưa hoàn toàn

source: %s:%u:%u: cannot convert
vi: %s:%u:%u: không thể chuyển đổi

source: %s: I/O error
vi: %s: lỗi nhập/xuất

source: conversion from %s unsupported
vi: không hỗ trợ khả năng chuyển đổi từ %s

source: conversion to %s unsupported
vi: không hỗ trợ khả năng chuyển đổi sang %s

source: conversion from %s to %s unsupported
vi: không hỗ trợ khả năng chuyển đổi từ %s sang %s

source: try '%s -l' to get the list of supported encodings
vi: hãy thử lệnh « %s -l » để xem danh sách các bảng mã được hỗ trợ

source: (stdin)
vi: (thiết bị nhập chuẩn)

source: I/O error
vi: Lỗi nhập/xuất
